risingMicrobubbleLattice/CASE_L/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    boxToCell
    {
        box (0.00025 -0.00075 0.00025) (0.001 0.00275 0.001);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    sphereToCell
    {
        origin (0.00075 -0.000255 0.00075);
	radius 0.0002;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }

);


// ************************************************************************* //
